{
  "Language Learning App": "تطبيق تعلم اللغة الانجليزية",
  "Settings": "الإعدادات",
  "Themes": "الثيمات",
  "Languages": "اللغات",
  "About": "حول",
  "Lessons": "الدروس",
  "Quizzes": "الاختبارات",
  "Entertainment": "الترفيه",
  "Games": "الألعاب",
  "Progress": "التقدم",
  "Community": "المجتمع",
  "Choose your preferred language:": "اختر لغتك المفضلة:",
  "English": "الإنجليزية",
  "Arabic": "العربية",
  "Are you sure you want to submit the quiz?": "هل أنت متأكد من رغبتك في تقديم الاختبار؟",
  "Cancel": "إلغاء",
  "Submit": "تقديم",
  "Quiz Results": "نتائج الاختبار",
  "Your Score:": "درجتك:",
  "Your Answer:": "إجابتك:",
  "Correct Answer:": "الإجابة الصحيحة:",
  "Your Quiz Results": "نتائج الاختبارات الخاصة بك",
  "Score:": "النتيجة:",
  "Welcome": "مرحبا",
  "Loading": "جار التحميل...",
  "Your Lessons": "دروسي",
  "Unlock Lesson: {lessonTitle}": "فتح الدرس: {lessonTitle}",
  "Complete the previous lesson to unlock this one.": "أكمل الدرس السابق لفتح هذا الدرس.",
  "Do you want to unlock this lesson?": "هل تريد فتح هذا الدرس؟",
  "Reset All Lessons": "إعادة تعيين جميع الدروس",
  "Are you sure you want to reset all lessons to locked state?": "هل أنت متأكد أنك تريد إعادة تعيين جميع الدروس إلى حالة مقفلة؟",
  "No": "لا",
  "Yes": "نعم",
  "Completed": "مكتمل",
  "OK": "حسنا",
  "Unlock Lesson: ${lesson.title}": "فتح الدرس",
  "Learn the English alphabet and basic sounds.": "تعلم الأبجدية الإنجليزية والأصوات الأساسية.",
  "Learn digits from 1 to 10": "تعلم الأرقام من 1 إلى 10",
  "Know more about colors": "تعرف على المزيد حول الألوان",
  "Learn everyday words like colors, numbers, and more.": "تعلم الكلمات اليومية مثل الألوان والأرقام والمزيد.",
  "Common phrases like \"Hello\" and \"How are you?\".": "عبارات شائعة مثل \"مرحباً\" و\"كيف حالك؟\".",
  "Understanding simple sentence structures.": "فهم هياكل الجمل البسيطة.",
  "Learn how to use pronouns and prepositions properly.": "تعلم كيفية استخدام الضمائر وحروف الجر بشكل صحيح.",
  "Practice dialogues for common situations.": "مارس الحوارات لمواقف شائعة.",
  "Forming sentences in the present tense.": "تكوين الجمل في زمن المضارع.",
  "Understanding and using the past simple tense correctly.": "فهم واستخدام زمن الماضي البسيط بشكل صحيح.",
  "Learn conditional sentences (if/then).": "تعلم الجمل الشرطية (إذا/ثم).",
  "How to report what others have said.": "كيفية الإبلاغ عما قاله الآخرون.",
  "Beginner Quizzes": "اختبارات المبتدئين",
  "Intermediate Quizzes": "اختبارات المتوسطين",
  "Advanced Quizzes": "اختبارات المتقدمين",
  "Empower Your Language": "تطوير لغتك",
  "Movie Recommendations": "توصيات الأفلام",
  "Series Recommendations": "توصيات المسلسلات",
  "Novel Recommendations": "توصيات الروايات",
  "Music Recommendations": "توصيات الموسيقى",
  "Question": "سؤال",
  "Gamified Experience": "تجربة تفاعلية",
  "Select The Correct Image According To Sound Button": "اختر الصورة الصحيحة بناءً على زر الصوت",
  "Great Job!": "عمل رائع!",
  "Quiz": "اختبار",
  "Progress & Achievements": "التقدم والإنجازات",
  "In Progress": "قيد التقدم",
  "No lessons in progress yet.": "لا توجد دروس قيد التقدم بعد.",
  "Achievements": "الإنجازات",
  "No completed lessons yet.": "لا توجد دروس مكتملة بعد.",
  "Completed Quizzes": "الاختبارات المكتملة",
  "No completed quizzes yet.": "لا توجد اختبارات مكتملة بعد.",
  "Reset Quizzes": "إعادة تعيين الاختبارات",
  "Add New Post": "إضافة مشاركة جديدة",
  "Title": "العنوان",
  "Content": "المحتوى",
  "Add": "أضف",
  "Delete Post": "حذف المشاركة",
  "Delete": "حذف",
  "Community Forum": "مشاركه المجتمع",
  "Add Comment": "إضافة تعليق",
  "Comment": "تعليق",
  "Comments": "التعليقات",
  "Dark Theme": "ثيم داكن",
  "Light Theme": "ثيم فاتح",
  "Toggle Theme": "تبديل الثيم",
  "Switch Languages": "تبديل اللغات",
  "Flashcards": "بطاقات الذاكرة",
  "Categories": "الفئات",
  "History": "التاريخ",
  "About This App": "حول هذا التطبيق",
  "Main Goal": "الهدف الرئيسي:",
  "Credits": "القائم بالعمل",
  "Developed by Ahmed Tayseer\nUndergraduate Software Developer": "تم التطوير بواسطة احمد تيسير\n مطور برامج جامعي",
  "Welcome to the Quiz App! Our app is designed to help you study effectively by creating and managing flashcards. You can add flashcards with questions and answers, and quiz yourself to reinforce your learning. The app tracks your quiz scores to help you monitor your progress.": "مرحبًا بك في تطبيق الاختبارات! تم تصميم تطبيقنا لمساعدتك على الدراسة بفعالية من خلال إنشاء وإدارة البطاقات التعليمية. يمكنك إضافة بطاقات تعليمية تحتوي على أسئلة وإجابات، واختبار نفسك لتعزيز تعلمك. يتتبع التطبيق درجات اختباراتك لمساعدتك في مراقبة تقدمك.",
  "Advanced Features": "الميزات المتقدمة:",
  "Beyond basic flashcard functionality, the app offers advanced features such as creating quizzes from lists and utilizing APIs for enhanced data management. You can also explore different categories with new questions each time you quiz yourself, ensuring a fresh and engaging study experience.": "إلى جانب الوظائف الأساسية للبطاقات التعليمية، يقدم التطبيق ميزات متقدمة مثل إنشاء اختبارات من القوائم واستخدام واجهات برمجة التطبيقات (APIs) لإدارة البيانات بشكل متقدم. يمكنك أيضًا استكشاف فئات مختلفة مع أسئلة جديدة في كل مرة تختبر نفسك، مما يضمن تجربة دراسة جديدة وممتعة.",
  "Contact Us": "تواصل معنا",
  "For any questions, feedback, or support, please reach out to us at:\nahmedtayseer424@gmail.com": "لأي أسئلة أو ملاحظات أو دعم، يرجى التواصل معنا عبر:\nahmedtayseer424@gmail.com",
  "Version": "الإصدار",
  "1.0.0": "1.0.0",
  "Confirm": "تأكيد",
  "Welcome to the English Language Learning App for Arabic Users! This version is designed to help Arabic speakers master English through interactive lessons, quizzes, and a gamified learning experience. Key features include progress tracking, achievements, and a community forum for connecting with other learners. This app will be updated in the future to support multiple languages, making language learning accessible to a wider audience.": "مرحبًا بكم في تطبيق تعلم اللغة الإنجليزية للمستخدمين العرب! تم تصميم هذا الإصدار لمساعدة المتحدثين باللغة العربية على إتقان الإنجليزية من خلال دروس تفاعلية، واختبارات، وتجربة تعليمية مبنية على اللعب. تشمل الميزات الرئيسية تتبع التقدم، والإنجازات، ومنتدى مجتمعي للتواصل مع المتعلمين الآخرين. سيتم تحديث هذا التطبيق في المستقبل لدعم لغات متعددة، مما يجعل تعلم اللغة متاحًا لجمهور أوسع.",
  "The English Language Learning App offers a wide range of interactive features designed to enhance your learning experience. It includes engaging lessons with videos, audio, and games to practice and improve your language skills. Users earn scores and experience points (XP) as they progress, and lessons are structured so that the next level cannot be accessed until the previous one is completed. Each lesson includes exams with varying levels of difficulty to test your knowledge.": "يوفر تطبيق تعلم اللغة الإنجليزية مجموعة واسعة من الميزات التفاعلية المصممة لتعزيز تجربة التعلم الخاصة بك. يتضمن دروسًا مشوقة مع مقاطع فيديو وصوت وألعاب لممارسة وتحسين مهاراتك اللغوية. يكسب المستخدمون درجات ونقاط خبرة (XP) مع تقدمهم، وهيكل الدروس بحيث لا يمكن الوصول إلى المستوى التالي حتى يتم إكمال المستوى السابق. تتضمن كل درس امتحانات بمستويات صعوبة متنوعة لاختبار معرفتك.",
  "The app also supports language swapping between Arabic and English, as well as a dark and light mode to suit your preferences. The simple and user-friendly interface makes it easy to navigate and customize your study sessions.": "يدعم التطبيق أيضًا تبديل اللغات بين العربية والإنجليزية، بالإضافة إلى وضع مظلم ووضع مضيء لتناسب تفضيلاتك. تجعل الواجهة البسيطة وسهلة الاستخدام من السهل التنقل وتخصيص جلسات دراستك.",
  "In addition to educational content, the app provides entertainment sections featuring movie and series recommendations, music suggestions, and interactive games, including quizzes that challenge you to listen and select related images based on sounds. The progress and achievements section tracks your accomplishments, quiz scores, and overall progress.": "بالإضافة إلى المحتوى التعليمي، يوفر التطبيق أقسامًا ترفيهية تتضمن توصيات للأفلام والمسلسلات، واقتراحات للموسيقى، وألعاب تفاعلية، بما في ذلك الاختبارات التي تتحداك للاستماع واختيار الصور ذات الصلة بناءً على الأصوات. قسم التقدم والإنجازات يتتبع إنجازاتك ودرجات الاختبارات والتقدم العام.",
  "The community forum allows users to add comments, like and dislike posts, create and delete their own posts, and interact with other learners. The app also integrates local and global data management, utilizing APIs to provide a rich and dynamic learning environment.": "تتيح منتديات المجتمع للمستخدمين إضافة تعليقات، والإعجاب وعدم الإعجاب بالمشاركات، وإنشاء وحذف مشاركاتهم الخاصة، والتفاعل مع المتعلمين الآخرين. كما يدمج التطبيق إدارة البيانات المحلية والعالمية، مستفيدًا من واجهات برمجة التطبيقات لتوفير بيئة تعليمية غنية وديناميكية."

}
